#---------------------------------------------------------------
#  ФУНКЦИЯ КОТОРАЯ ПОЗВОЛЯЕТ УДАЛИТЬ СИМВОЛ ПО ЕГО ИНДЕКСУ В СТРОКЕ
#---------------------------------------------------------------
def remove(s, indx):
        return ''.join(x for x in s if s.index(x) != indx)


#---------------------------------------------------------------
# ФУНКЦИЯ КОТОРАЯ ПОМЕЩАЕТ В СПИСОК СТРОКИ БЕЗ СИМВОЛА ПЕРЕНОСА СТРОКИ
#---------------------------------------------------------------
def po_strochno(fail):
    stroki_v_spiske=[]

    f_fail = open(fail, encoding='utf-8')        # Открываем файл fail в кодировке 'utf-8'

    for line in f_fail.readlines():
        kol_sumb=len(line)-1
        if line[-1]=="\n":                       # Если последний символ строки = "\n" удаяем его
            line=remove(line, kol_sumb)          #
        stroki_v_spiske.append(line)

    f_fail.close()                               # Закрываем открытый прежде файл fail
    return stroki_v_spiske


#---------------------------------------------------------------
#  ФУНКЦИЯ КОТОРАЯ ВОЗВРОЩАЕТ СТРОКУ С ИНДЕКСОМ "number" БЕЗ СИМВОЛА ПЕРЕНОСА СТРОКИ
#---------------------------------------------------------------
def str(number,fail):
    z=po_strochno(fail)
    return z[number]


#---------------------------------------------------------------
#  ФУНКЦИЯ КОТОРАЯ ВОЗВРОЩАЕТ ЧИСЛО СТРОК В ФАЙЛЕ
#---------------------------------------------------------------
def chislo_strok(fail):
    z = len(open(fail, encoding='utf-8').readlines())
    return z


#---------------------------------------------------------------
#  ФУНКЦИЯ КОТОРАЯ ВОЗВРОЩАЕТ ДЛИНУ СТРОКИ
#---------------------------------------------------------------
def dlina_stroki():
    with open('text.txt', encoding='utf-8') as f:
        size=sum(1 for _ in f)
        return size
